app/views/contracts/show.html.erb

  <dt>Ferramentas</dt>
  <% @contract.tools.each do |tool| %>
---
SELECT "tools".* FROM "tools"