app/controllers/clients_controller.rb

  def create
    @client = Client.new(client_params)
    if @client.save
---
INSERT INTO "clients" ("company_name", "cnpj", "contact_name", "phone", "email", "address", "address_number", "aditional_address_detail", "zipcode", "neighborhood", "city", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)