app/controllers/contracts_controller.rb

  def set_collections
    @clients = Client.all
    @tools = Tool.all
---
SELECT "tools".* FROM "tools"

  def set_tool
    @tool = Tool.find(params[:id])
---
SELECT  "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT 1  [["id", 1]]

  def set_contract
    @contract = Contract.find(params[:id])
---
SELECT  "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT 1  [["id", 1]]